"use strict"

// Задача 24. Для заданого натурального числа n знайти найменше число k, яке задовольняє нерівність k!>=n.
// Факторіа числа, наприклад  5! = 1 * 2 * 3 * 4 * 5 = 120.

// Запитуємо у користувача число
const n = parseInt(prompt('Введіть будь-яке натуральне число', ''))
// Вказуємо найменше натуральне число
let k = 1
// Заводимо змінну для факторіалу
let factorial = 1
// Цикл
do {
    // Факторіал кожний раз множимо на k
    factorial *= k
    // Якщо умова виконалась то перериваємо цикл
    if(factorial >= n) break
    // Якщо умова не виконалась, то збільшуємо число k на 1 і повторюємо ітерацію
    else k++
    // Цикл виконується поки виконується умова, що факторіал менше числа n
} while (factorial < n)
//
document.write(`k = ${k}`)