"use strict"

// Задача 20. На складі зберігається певна кількість ящиків з яблуками (наприклад, 15). Коли під’їде машина для завантаження, попросити користувача ввести, скільки ящиків завантажити у першу машину, у другу і т. д., поки на складі не закінчаться ящики з яблуками. Передбачити той випадок, коли користувач вводить кількість, що перевищує поточну кількість ящиків на складі.

//Вводимо кількість ящиків
const boxes = 15
let boxQuantity = boxes
let carCount = 1;
while (boxQuantity > 0) {
    const userAnswer = parseInt(prompt(`Введіть скільки ящиків завантажити в ${carCount} машину?`, '5'))

    if (userAnswer > boxQuantity) {
        alert(`Ящиків недостатньо. Залишилось - ${boxQuantity} ящиків`)
        continue
    }

    boxQuantity -= userAnswer

    alert(`Залишилось - ${boxQuantity} ящиків`)

    carCount++
}
document.write(`Всього ящиків було ${boxes}. Ви завантажили ${carCount - 1} машини.`)