"use strict"

// Задача 19. Зобразити рівнобедрений трикутник із символів ^. Висоту задає користувач.

if (confirm('Почати тестування?')) {
	// Запитуємо у юзера висоту
	const height = parseInt(prompt('Введіть бажану висоту трикутника', '10'))

	for (let i = 1; i <= height; i++) {
		// Створюємо рядок
		let row = ``
		// Їх буде стільки, скільки введе користувач

		// Створюємо ще один цикл, він буде додавати пробіли, у формулі має бути кількість пробілів, скільки треба їх вставити, тому це висота - i, на першій ітерації це буде висота - 1, бо один знак ^, на другій висота -2, на третій висота - 3 і так далі
		for (let j = 1; j <= height - i; j++) {
			row += ' '
		}

		// Тепер ще один цикл для виводу знаків ^, в формулі маємо показати скільки таких знаків має виводитись
		for (let k = 0; k < (2 * i - 1); k++) {
			row += '^'
		}
		row += '\n'
		// Виводимо трикутник в один тег <pre>, щоб зберегти форматування
		document.write(`<pre>${row}</pre>`)
	}
}