"use strict"

// Задача 21. Написати програму, яка показуватиме на екрані піднесене до квадрату число, що вводиться користувачем. Користувач вирішує самостійно – виходити з програми або продовжувати ввід. (Підказка: потрібно запустити нескінчений цикл, в тілі якого передбачити його переривання у випадку настання певної умови).

if (confirm('Почати тестування?')) {
    do {
        const userNumber = parseInt(prompt('Введіть будь-яке число', '10'))
        alert(`Квадрат введенного Вами числа складає ${Math.pow(userNumber, 2)}`)
        const userAnswer = confirm('Ви бажаєте продовжити ввід чисел?')

        if (!userAnswer) {
            break
        }
    } while (true)
}