"use strict"

// Задача 01. Дано ширину екрана та кількість елементів, які повинні бути відображені у рядку.Визначити ширину елементів, які повинні бути відображені у цьому рядку.

/* Позначення
	windowidth - ширина екрана
	itemsQuantity - кількість елементів, які повинні бути відображені у рядку

	itemWidth - ширина елементів, які повинні бути відображені у цьому рядку.
*/

// Введення необхідних данних

const windowidth = parseInt(prompt('Введіть будь-яку ширину екрана', '1200'));
const itemsQuantity = parseInt(prompt('Введіть будь-яку кількість елементів', '7'));

// Обчислення результатів

const itemWidth = Math.floor(windowidth / itemsQuantity);

// Виведення результатів

document.write(`
	<h2>Задача 01</h2>
	<p>Дано ширину екрана та кількість елементів, які повинні бути відображені у рядку.Визначити ширину елементів, які повинні бути відображені у цьому рядку.</p>
	<p>В екрані шириною ${windowidth}px можуть бути відображені ${itemsQuantity} елементів шириною ${itemWidth}px</p>
	`)

// ================================================================================================================================

// Задача 02. З клавіатури вводиться розмір заробітної плати та розмір прожиткового мінімуму. Визначити розмір соціальної допомоги (ввжаємо, що заробітна плата є меншою).

/* Позначення
	salary - розмір заробітної плати
	subsistenceMinimum - розмір прожиткового мінімуму

	socialHelp - розмір соціальної допомоги
*/

// Введення необхідних данних

const subsistenceMinimum = parseInt(prompt('Введіть розмір прожиткового мінімуму', '4500'));
const salary = parseInt(prompt('Введіть розмір заробітної плати, що є менше розміру прожиткового мінімуму', '3980'));


// Обчислення результатів

const socialHelp = subsistenceMinimum - salary;

// Виведення результатів

document.write(`
	<h2>Задача 02</h2>
	<p>З клавіатури вводиться розмір заробітної плати та розмір прожиткового мінімуму. Визначити розмір соціальної допомоги (ввжаємо, що заробітна плата є меншою).</p>
	<p>Розмір соціальної допомоги складає ${socialHelp}грн</p>
	`)

// ================================================================================================================================


// Задача 04. З клавіатури вводиться вік дитини. Вивести на екран через скільки років вона буде відвідувати садочок, піде у школу, закінчить школу, вступить і закінчить

/* Позначення
	childAge - вік дитини
	
	
*/

// Введення необхідних данних

// const subsistenceMinimum = parseInt(prompt('Введіть розмір прожиткового мінімуму', '4500'));
// const salary = parseInt(prompt('Введіть розмір заробітної плати, що є менше розміру прожиткового мінімуму', '3980'));


// Обчислення результатів

// const socialHelp = subsistenceMinimum - salary;

// Виведення результатів

document.write(`
	<h2>Задача 02</h2>
	<p>З клавіатури вводиться розмір заробітної плати та розмір прожиткового мінімуму. Визначити розмір соціальної допомоги (ввжаємо, що заробітна плата є меншою).</p>
	<p>Розмір соціальної допомоги складає ${socialHelp}грн</p>
	`)







// Задача 14. З клавіатури вводиться номер дня тижня (від 1 до 7). Визначити який буде день тижня через N днів.

/* Позначення
	weekNumberDay - номер дня тижня (від 1 до 7)
	randomNumberDays - день тижня через N днів

	weekNumberDayAfterNDays - день тижня через N днів
*/

// Введення необхідних данних

const weekNumberDay = parseInt(prompt('Введіть будь-який день тижня (від 1 до 7)', '2'));
const randomNumberDays = parseInt(prompt('Введіть будь-яку кількість днів', '7'));

// Обчислення результатів

const weekNumberDayAfterNDays = (weekNumberDay + randomNumberDays - 1) % 7 + 1;

// Виведення результатів

document.write(`
	<h2>Задача 14</h2>
	<p>З клавіатури вводиться номер дня тижня (від 1 до 7). Визначити який буде день тижня через N днів.</p>
	<p>Через ${randomNumberDays} днів буде ${weekNumberDayAfterNDays} день тижня</p>
	`)